Documents/ЗаказНаВыдачуСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаказНаВыдачуСИЗ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СформированныеЗаказыНаВыдачуСИЗ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСИЗИстекающиеВТечениеМесяца</Name>
					<Comment>При заполнении и подборе сотрудников, включать в заказ СИЗ, которые истекаю в течение ближайшего месяца</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>// АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураСИЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СИЗ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВыдачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дежурное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаПериодичностиВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследняяВыдача</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СпособыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоИзноса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаВыдачуСИЗ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОхранаТрудаКлиентСервер.ЗаполнитьПредставлениеДокумента(Данные, Представление, НСтр("ru = 'Заказ на выдачу СИЗ'"));
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ВыдачаСИЗ.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, , "ОхранаТруда");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ЗаказНаВыдачуСИЗ;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ЗаказНаВыдачуСИЗ";
	КомандаПечати.Идентификатор = "ПФ_MXL_ЗаказНаВыдачуСИЗ";
	КомандаПечати.Представление = НСтр("ru = 'Заказ на выдачу СИЗ'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЗаказНаВыдачуСИЗ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ЗаказНаВыдачуСИЗ",
			НСтр("ru = 'Заказ на выдачу СИЗ'"), ПечатьЗаказаНаВыдачуСИЗ(МассивОбъектов, ОбъектыПечати), ,
			"Документ.ЗаказНаВыдачуСИЗ.ПФ_MXL_ЗаказНаВыдачуСИЗ");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьЗаказаНаВыдачуСИЗ(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказНаВыдачуСИЗ_РабочиеМеста";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказНаВыдачуСИЗ.ПФ_MXL_ЗаказНаВыдачуСИЗ");
	
	ДанныеДляПечати = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	Для Каждого ОписаниеДокумента Из ДанныеДляПечати Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		// Формируем печатную форму заказа.
		Результат = Новый ТабличныйДокумент;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(ОписаниеДокумента);
		Результат.Вывести(ОбластьМакета);
		ТаблицаСИЗ = ОписаниеДокумента.ТаблицаСИЗ;
		СотрудникСИЗ = Неопределено;
		Для Каждого СтрокаСИЗ Из ТаблицаСИЗ Цикл
			Если СтрокаСИЗ.ФизическоеЛицо <> СотрудникСИЗ Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаОбъединенная");
			КонецЕсли;
			СотрудникСИЗ = СтрокаСИЗ.ФизическоеЛицо;
			ОбластьМакета.Параметры.Заполнить(ОписаниеДокумента);
			ОбластьМакета.Параметры.Заполнить(СтрокаСИЗ);
			Результат.Вывести(ОбластьМакета);
		КонецЦикла;
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ОписаниеДокумента);
		Результат.Вывести(ОбластьМакета);
		ТабличныйДокумент.Вывести(Результат);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ОписаниеДокумента.ДокументСсылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаВыдачу.Ссылка КАК ДокументСсылка,
		|	ЗаказНаВыдачу.Номер,
		|	ЗаказНаВыдачу.Дата,
		|	ЗаказНаВыдачу.ДатаЗаказа,
		|	ЗаказНаВыдачу.Организация,
		|	ЗаказНаВыдачу.Подразделение,
		|	Организации.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ЗаказНаВыдачу.Ответственный КАК Ответственный,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Документ.ЗаказНаВыдачуСИЗ.НоменклатураСИЗ КАК ПереченьСИЗ
		|			ГДЕ
		|				ПереченьСИЗ.Ссылка = ЗаказНаВыдачу.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьСИЗ
		|ИЗ
		|	Документ.ЗаказНаВыдачуСИЗ КАК ЗаказНаВыдачу
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ЗаказНаВыдачу.Организация = Организации.Ссылка
		|ГДЕ
		|	ЗаказНаВыдачу.Ссылка В (&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНаВыдачуРабочиеМеста.Ссылка КАК ДокументСсылка,
		|	ЗаказНаВыдачуРабочиеМеста.РабочееМесто,
		|	ЗаказНаВыдачуРабочиеМеста.Подразделение,
		|	ЗаказНаВыдачуРабочиеМеста.Должность,
		|	ЗаказНаВыдачуРабочиеМеста.ФизическоеЛицо,
		|	ЗаказНаВыдачуСИЗ.СИЗ КАК СИЗ,
		|	ЗаказНаВыдачуСИЗ.Количество КАК Количество,
		|	ЗаказНаВыдачуСИЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЗаказНаВыдачуСИЗ.НормаВыдачи КАК НормаВыдачи,
		|	ЗаказНаВыдачуСИЗ.ПоследняяВыдача,
		|	ЗаказНаВыдачуСИЗ.НомерСтроки КАК НомерСтрокиСИЗ,
		|	ЗаказНаВыдачуРабочиеМеста.НомерСтроки КАК НомерСтроки,
		|	ЗаказНаВыдачуСИЗ.Размер КАК Размер,
		|	ЗаказНаВыдачуСИЗ.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	ЗаказНаВыдачуСИЗ.ЕдиницаПериодичностиВыдачи КАК ЕдиницаПериодичностиВыдачи,
		|	ЗаказНаВыдачуСИЗ.КратностьВыдачи КАК КратностьВыдачи,
		|	ЗаказНаВыдачуСИЗ.СпособВыдачи КАК СпособВыдачи
		|ИЗ
		|	Документ.ЗаказНаВыдачуСИЗ.РабочиеМеста КАК ЗаказНаВыдачуРабочиеМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВыдачуСИЗ.НоменклатураСИЗ КАК ЗаказНаВыдачуСИЗ
		|		ПО ЗаказНаВыдачуРабочиеМеста.Ссылка В (&МассивОбъектов)
		|		И ЗаказНаВыдачуРабочиеМеста.Ссылка = ЗаказНаВыдачуСИЗ.Ссылка
		|		И ЗаказНаВыдачуРабочиеМеста.ИдентификаторСтрокиРабочегоМеста = ЗаказНаВыдачуСИЗ.ИдентификаторСтрокиРабочегоМеста
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка,
		|	НомерСтроки,
		|	НомерСтрокиСИЗ";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	МаксимальныйИндекс = РезультатыЗапроса.ВГраница();
	
	ВыборкаСИЗ = РезультатыЗапроса[МаксимальныйИндекс].Выбрать();
	ВыборкаДокументов = РезультатыЗапроса[МаксимальныйИндекс - 1].Выбрать();
	Пока ВыборкаДокументов.Следующий() Цикл
		Описание = ОписаниеДляПечати();
		ЗаполнитьОписание(Описание, ВыборкаДокументов, ВыборкаСИЗ);
		ДанныеПечатиОбъектов.Добавить(Описание);
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

Функция ОписаниеДляПечати()
	
	Описание = Новый Структура;
	Описание.Вставить("ДокументСсылка");
	Описание.Вставить("Дата");
	Описание.Вставить("Номер");
	Описание.Вставить("ДатаЗаказа");
	Описание.Вставить("ОрганизацияНаименованиеПолное");
	Описание.Вставить("ПодразделениеПредставление");
	Описание.Вставить("ТаблицаСИЗ");
	Описание.Вставить("Ответственный");
	
	ТаблицаСИЗ = Новый ТаблицаЗначений;
	ТаблицаСИЗ.Колонки.Добавить("ДокументСсылка", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаВыдачуСИЗ"));
	ТаблицаСИЗ.Колонки.Добавить("НомерСтрокиСИЗ", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаСИЗ.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаСИЗ.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ТаблицаСИЗ.Колонки.Добавить("СИЗ", Новый ОписаниеТипов("СправочникСсылка.СредстваИндивидуальнойЗащиты"));
	ТаблицаСИЗ.Колонки.Добавить("Размер", Новый ОписаниеТипов("СправочникСсылка.Размеры,Число"));
	ТаблицаСИЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаСИЗ.Колонки.Добавить("НормаВыдачи", Новый ОписаниеТипов("Строка"));
	ТаблицаСИЗ.Колонки.Добавить("ПоследняяВыдача", Новый ОписаниеТипов("Дата"));
	ТаблицаСИЗ.Колонки.Добавить("СледующаяВыдача", Новый ОписаниеТипов("Дата"));
	ТаблицаСИЗ.Колонки.Добавить("ПериодичностьВыдачи", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("ЕдиницаПериодичностиВыдачи", Новый ОписаниеТипов("ПеречислениеСсылка.Периодичность"));
	ТаблицаСИЗ.Колонки.Добавить("КратностьВыдачи", Новый ОписаниеТипов("Число"));
	ТаблицаСИЗ.Колонки.Добавить("СпособВыдачи", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыВыдачиСИЗ"));
	
	Описание.ТаблицаСИЗ = ТаблицаСИЗ;
	
	Возврат Описание;
	
КонецФункции

Процедура ЗаполнитьОписание(Описание, ВыборкаДокументов, ВыборкаСИЗ)
	
	ЗаполнитьЗначенияСвойств(Описание, ВыборкаДокументов);
	
	Описание.Дата = Формат(ВыборкаДокументов.Дата, "ДЛФ=D");
	Описание.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаДокументов.Номер);
	Описание.ДатаЗаказа = Формат(ВыборкаДокументов.ДатаЗаказа, "ДЛФ=ДД");
	Описание.ПодразделениеПредставление = Строка(ВыборкаДокументов.Подразделение);
	
	Если ВыборкаДокументов.ЕстьСИЗ Тогда
		Пока ВыборкаСИЗ.НайтиСледующий(ВыборкаДокументов.ДокументСсылка, "ДокументСсылка") Цикл
			НоваяСтрока = Описание.ТаблицаСИЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСИЗ);
			Если ЗначениеЗаполнено(НоваяСтрока.ПоследняяВыдача)
				И ВыборкаСИЗ.СпособВыдачи <> Перечисления.СпособыВыдачиСИЗ.ДоИзноса Тогда
				
				ОписаниеПериодичности = СредстваИндивидуальнойЗащиты.ОписаниеПериодичностиВыдачи();
				ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, ВыборкаСИЗ);
				ОписаниеПериодичности.Кратность = ВыборкаСИЗ.КратностьВыдачи;
				ОписаниеПериодичности.Периодичность = ВыборкаСИЗ.ПериодичностьВыдачи;
				ОписаниеПериодичности.ЕдиницаПериодичности = ВыборкаСИЗ.ЕдиницаПериодичностиВыдачи;
				НоваяСтрока.СледующаяВыдача = СредстваИндивидуальнойЗащиты.ДатаСледующейВыдачи(
					НоваяСтрока.ПоследняяВыдача, ОписаниеПериодичности);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ОписаниеПодписейДокумента() Экспорт 
	
	ОписаниеПодписей = ПодписиДокументов.ОписаниеТаблицыПодписей();
	
	ПодписиДокументов.ДобавитьОписаниеПодписейОрганизации(ОписаниеПодписей, "Руководитель, ОтветственныйЗаОхрануТруда");
	
	Возврат ОписаниеПодписей;
		
КонецФункции

#КонецОбласти

#КонецЕсли
